---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.AllUsersAddinsLocation
source: html/725b6bf2-737f-af7d-a0ab-e93bdaba3b5e.htm
---
# Autodesk.Revit.ApplicationServices.Application.AllUsersAddinsLocation Property

The folder location for .addin files for all users.

## Syntax (C#)
```csharp
public string AllUsersAddinsLocation { get; }
```